Revit 2027 API
PartUtils.ArePartsValidForMerge Method
 Identifies whether Part elements may be merged.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ArePartsValidForMerge(
	Document document,
	ICollection<ElementId> partIds
)
Public Shared Function ArePartsValidForMerge (
	document As Document,
	partIds As ICollection(Of ElementId)
) As Boolean
public:
static bool ArePartsValidForMerge(
	Document^ document,
	ICollection<ElementId^>^ partIds
)
static member ArePartsValidForMerge :
        document : Document *
        partIds : ICollection<ElementId> -> bool
Parameters
document Document
 The document.
partIds ICollection<ElementId>
 Element ids of Parts.
Return Value
Boolean
 True if all element ids correspond to Part elements, none of the parts already has associated parts, the parts have contiguous geometry, all report the same materials, and all have the same creation and demolition phases.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartUtils Class
Autodesk.Revit.DB Namespace